### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

### groupby

<img src='https://www.w3resource.com/w3r_images/pandas-groupby-split-apply-combine.svg'>

- 데이터 그룹 연산 수행 단계
    - 원본 데이터 셋을 그룹별로 분할(split)
    - 분할된 각 그룹에 함수 적용
    - 결과 통합

### [실습1]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

origin
europe     70
japan      79
usa       249
dtype: int64

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [ ]:
# origin 별로 평균값을 보고 싶다면?

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [ ]:
# cylinders 값만 보고 싶다면?

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [ ]:
# origin 별 cylinders 중간값 보기

origin
europe    4
japan     4
usa       6
Name: cylinders, dtype: int64

In [ ]:
# 그룹을 여러개 설정

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
            usa       6.200000
72          europe    4.000000
            japan     3.800000
            usa       6.888889
73          europe    4.000000
            japan     4.250000
            usa       7.241379
74          europe    4.000000
            japan     4.000000
            usa       6.266667
75          europe    4.000000
            japan     4.000000
            usa       6.400000
76          europe    4.250000
            japan     4.500000
            usa       6.363636
77          europe    4.000000
            japan     4.166667
            usa       6.222222
78          europe    4.833333
            japan     4.000000
            usa       6.000000
79          europe    4.250000
            japan     4.000000
            usa       6.260870
80          europe    4.111111
            japan     4.076923
            usa       4.285714
81          europe    4.500000
            japan     4.333333
            usa       4.923077
82          europe    4.000000
            japan     4.000000
            usa       4.300000
Name: cylinders, dtype: float64

### [실습2]

    A    B     Data1     Data2
0  ha  one  0.051816 -0.512749
1  hi  two -0.607749  0.445857
2  ho  one -0.649755  0.492480
3  ha  one  0.146757  0.807262
4  ho  two  1.404326  1.580776

       Data1     Data2
A
ha  0.198572  0.294513
hi -0.607749  0.445857
ho  0.754571  2.073256

        Data1     Data2
B
one -0.150394  0.262331
two  0.398289  1.013317

- agg() : 여러 개의 함수를 넣을 수도 혹은 하나의 함수만 넣을 수도 있음

       Data1                         Data2
         sum      mean       std       sum      mean       std
A
ha  0.198572  0.099286  0.067133  0.294513  0.147257  0.933388
hi -0.607749 -0.607749       NaN  0.445857  0.445857       NaN
ho  0.754571  0.377285  1.452455  2.073256  1.036628  0.769542

       Data1     Data2
A
ha  0.198572  0.294513
hi -0.607749  0.445857
ho  0.754571  2.073256

         sum      mean       std
A
ha  1.719270  0.859635  0.450974
hi  0.384548  0.384548       NaN
ho  0.956579  0.478290  0.289729

          합계        평균      표준편차
A
ha  0.198572  0.099286  0.067133
hi -0.607749 -0.607749       NaN
ho  0.754571  0.377285  1.452455

### [실습3]

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

              major  0
0  Computer Science  4
1         Economics  3
2           Physics  1
3        Psychology  3

In [ ]:
# 학과별로 몇 명이 있는지 알고 싶다면?

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

Computer Science : 4
       name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
Economics : 3
    name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
Physics : 1
      name    major gender
2  Abraham  Physics   male
Psychology : 3
     name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [ ]:
# 학과별로 데이터프레임 생성하고 싶다면?

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [ ]:
# major 을 column 으로 설정

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [ ]:
# 성별로 그룹화 하기

{'female': [4, 5, 6, 8, 9, 10], 'male': [0, 1, 2, 3, 7]}

female : 6
        name             major  gender
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
male : 5
      name             major gender
0     John  Computer Science   male
1     Nate  Computer Science   male
2  Abraham           Physics   male
3    Brian        Psychology   male
7   Edward  Computer Science   male

### [실습]

In [ ]:
# 자동차 대리점의 판매 차종, 판매 수량, 단가, 총 판매가

    Branch  Car Name  Quantity  Unit Price  Ext Price
0  Yeonnam  Grandeur         7          35        245
1  Yeonnam    Sonata        11          20        220
2  Yeonnam    Avante         3          15         45
3  Sungsan  Grandeur         5          36        180
4  Sungsan    Sonata        19          19        361
5  Sungsan    Avante         9          14        126
6   Yeonhi  Grandeur        10          34        340
7   Yeonhi    Sonata        13          19        247
8   Yeonhi    Avante        15          13        195

In [ ]:
# 3개 대리점에서 판매된 매출액 구하기

Branch
Sungsan    667
Yeonhi     782
Yeonnam    510
Name: Ext Price, dtype: int64

#### 결과를 데이터프레임으로 생성

#### [방법1]

         Ext Price
Branch
Sungsan        667
Yeonhi         782
Yeonnam        510

#### [방법2]

    Branch  Br_Total
0  Sungsan       667
1   Yeonhi       782
2  Yeonnam       510

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total
0  Yeonnam  Grandeur         7          35        245       510
1  Yeonnam    Sonata        11          20        220       510
2  Yeonnam    Avante         3          15         45       510
3  Sungsan  Grandeur         5          36        180       667
4  Sungsan    Sonata        19          19        361       667
5  Sungsan    Avante         9          14        126       667
6   Yeonhi  Grandeur        10          34        340       782
7   Yeonhi    Sonata        13          19        247       782
8   Yeonhi    Avante        15          13        195       782

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total
0  Yeonnam  Grandeur         7          35        245       510
1  Yeonnam    Sonata        11          20        220       510
2  Yeonnam    Avante         3          15         45       510
3  Sungsan  Grandeur         5          36        180       667
4  Sungsan    Sonata        19          19        361       667
5  Sungsan    Avante         9          14        126       667
6   Yeonhi  Grandeur        10          34        340       782
7   Yeonhi    Sonata        13          19        247       782
8   Yeonhi    Avante        15          13        195       782

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total     Br_Pct
0  Yeonnam  Grandeur         7          35        245       510  48.039216
1  Yeonnam    Sonata        11          20        220       510  43.137255
2  Yeonnam    Avante         3          15         45       510   8.823529
3  Sungsan  Grandeur         5          36        180       667  26.986507
4  Sungsan    Sonata        19          19        361       667  54.122939
5  Sungsan    Avante         9          14        126       667  18.890555
6   Yeonhi  Grandeur        10          34        340       782  43.478261
7   Yeonhi    Sonata        13          19        247       782  31.585678
8   Yeonhi    Avante        15          13        195       782  24.936061

### transform()

0    510
1    510
2    510
3    667
4    667
5    667
6    782
7    782
8    782
Name: Ext Price, dtype: int64

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total    Br_Pct
0  Yeonnam  Grandeur         7          35        245       510  0.480392
1  Yeonnam    Sonata        11          20        220       510  0.431373
2  Yeonnam    Avante         3          15         45       510  0.088235
3  Sungsan  Grandeur         5          36        180       667  0.269865
4  Sungsan    Sonata        19          19        361       667  0.541229
5  Sungsan    Avante         9          14        126       667  0.188906
6   Yeonhi  Grandeur        10          34        340       782  0.434783
7   Yeonhi    Sonata        13          19        247       782  0.315857
8   Yeonhi    Avante        15          13        195       782  0.249361

### 실습

    School   Name  Math_s
0   Yeonhi  Haena      92
1   Yeonhi   Gisu      70
2  Sungsan    Una      88
3  Sungsan  Naeun      92
4  Sungsan   Ziho      70

In [ ]:
# school을 그룹으로 하여 수학 성적의 평균 구하기

    School      Avg_s
0  Sungsan  83.333333
1   Yeonhi  81.000000

    School   Name  Math_s      Avg_s
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

- transform() 을 사용시

    School   Name  Math_s      Avg_s
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

- apply() : apply(적용할함수)

'C'

    School   Name  Math_s      Avg_s grade
0   Yeonhi  Haena      92  81.000000     A
1   Yeonhi   Gisu      70  81.000000     F
2  Sungsan    Una      88  83.333333     B
3  Sungsan  Naeun      92  83.333333     A
4  Sungsan   Ziho      70  83.333333     F

In [ ]:
df_m.groupby('School').apply(sort_math,n=2)

            School   Name  Math_s      Avg_s grade
School
Sungsan 4  Sungsan   Ziho      70  83.333333     F
        2  Sungsan    Una      88  83.333333     B
Yeonhi  1   Yeonhi   Gisu      70  81.000000     F
        0   Yeonhi  Haena      92  81.000000     A